In [1]:
import pandas as pd
import numpy as np

In [18]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,23,32],
       'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Aravind', 'Samar', nan, 'Siri'],
 'Age': [nan, 21, 23, 32],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

# d1=pd.DataFrame(dict1)
d1

In [21]:
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  23.0  Chennai
3     Siri  32.0      NaN

In [20]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [14]:
dict2={'Names':['Aravind','Samar',None,'Siri'],
       'Age':[np.nan,21,23,32],
       'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2     None  23.0  Chennai
3     Siri  32.0     None

In [23]:
dict2.isnull()

AttributeError: 'dict' object has no attribute 'isnull'

In [24]:
d1.isnull().sum()*100/len(d1)

# percentage

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan : IT IS NON A NUMBER,THIS IS APPLICABLE FOR ONLY NUMERICAL COLUMNS ONLY

- GENERALLY DATA HAS SOME EMPTY ROWS 

- IT IS A DATA PROBLEM

- IF YOU READ THAT KIND OF DATA YOU WILL SEE NULL

- YOU NEED TO UNDERSTAND IT IS A DATA CORRUPTED OR REALLY A NULL VALUES ARE THERE

# METHOD - 1

# FILL WITH SOME RANDOM VALUES

**METHOD NAME : fill na

In [ ]:
d1.fillna(40)

# METHOD - 2 

- WE CAN FILL THE VALUES W.R.T COLUMNS ALSO

In [25]:
d1['Age'].fillna(40)

# it will not updated

# inplace=false

0    40.0
1    21.0
2    23.0
3    32.0
Name: Age, dtype: float64

In [26]:
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  23.0  Chennai
3     Siri  32.0      NaN

In [27]:
d1['Age'].fillna(40,inplace=True)

In [28]:
d1

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2      NaN  23.0  Chennai
3     Siri  32.0      NaN

# METHOD -3 

- BFILL

- FFILL

- PAD

- BACKFILL

In [34]:
d1.fillna(method='bfill')

C:\Users\pc\AppData\Local\Temp\ipykernel_9060\439548242.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2     23.0  23.0  Chennai
3     Siri  32.0      NaN

In [35]:
d1.fillna(method='bfill',axis=1)

C:\Users\pc\AppData\Local\Temp\ipykernel_9060\981496262.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill',axis=1)

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2     23.0  23.0  Chennai
3     Siri  32.0      NaN

In [36]:
d1.fillna(method='ffill')

C:\Users\pc\AppData\Local\Temp\ipykernel_9060\4088926743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2    Samar  23.0  Chennai
3     Siri  32.0  Chennai

In [37]:
d1.fillna(method='pad')

C:\Users\pc\AppData\Local\Temp\ipykernel_9060\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2    Samar  23.0  Chennai
3     Siri  32.0  Chennai

In [38]:
d1.fillna(method='backfill')

C:\Users\pc\AppData\Local\Temp\ipykernel_9060\907203477.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='backfill')

     Names   Age     City
0  Aravind  40.0      Hyd
1    Samar  21.0      Blr
2     Siri  23.0  Chennai
3     Siri  32.0      NaN

# METHOD - 4

- MEAN

    - NUMERICAL VALUES CAN FILL WITH MEAN MEAN

    - BUT MEAN AFFECT BY OUTLIERS

    - IF WE DONT HAVE OUTLIERS IT IS BEST ONE

- MEDIAN 

    - NUMERICAL VALUES CAN BE FILLED WITH MEDIAN VALUE

    - WE KNOW THAT MEDIAN VALUES DOESNOT AFFECT WITH OUTLIERS

    - SO IF OUTLIERS ARE THERE WE CAN GO WITH MEDIAN

- MODE

    - MODE IS USEFUL FOR CATEGORICAL DATA

In [40]:
dict1={'Names':['Aravind','Samar',np.nan,'Siri'],
       'Age':[np.nan,21,23,32],
       'City':['Hyd','Blr','Chennai',np.nan]}
d1=pd.DataFrame(dict1)
d1

     Names   Age     City
0  Aravind   NaN      Hyd
1    Samar  21.0      Blr
2      NaN  23.0  Chennai
3     Siri  32.0      NaN

In [ ]:
# we already know we can fill some values based on specific

In [41]:
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    25.333333
1    21.000000
2    23.000000
3    32.000000
Name: Age, dtype: float64

In [42]:
age_median=d1['Age'].median()
d1['Age'].fillna(age_median)

0    23.0
1    21.0
2    23.0
3    32.0
Name: Age, dtype: float64

In [43]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    23.0
3    32.0
Name: Age, dtype: float64

In [44]:
d1['City'].mode()

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

# METHOD - 5

**KNN IMPUTER**

- KNN : K NEARTEST NEIGHBOURS

- K IS A HYPER PARAMETER MEANS USER CAN CHOOSE

- IT IS A DISTANCE METRIC : **EUCLIDIAN DISTANCE**

In [1]:
a=10
b=20
c=a+b
print(c)

30